{"data":{"site":{"siteMetadata":{"blurb":"Frontend Engineer @ Qantas. Tinkerer of things. Tea lover. Passionate about react graphql and making things fast."}},"markdownRemark":{"html":"<p>My first NDC conference (anywhere) I have to say the whole event was very well planned, although there are a\ncouple of things which can be improved:</p>\n<ul>\n    <li>Wifi connection - the Hilton's wifi connection was so crap, all the guest speakers especially american and uk\n    speakers think that Australia as a whole are running on a 56k modem. I actually attended a session where the speaker had\n    to tether from an Android 4G connection just to demo his stuff (Peter Myers, please forgive us). If you are from overseas \n    speaking/spoke at NDC Sydney, please accept our sincerest apology, and please don't misunderstand. Our internet connection \n    in Australia is pretty good, it's just at Hilton's, so please forgive us.</li>\n    <br/>\n    <li>Pricing was a bit steep. I understand Sydney is one of the most expensive cities in the world, yes yes. It's such \n    a shame though many developers are left out of NDC because of pricing/cost. Personally I know many a great\n    developer that missed out on NDC Sydney purely due to financial reasons. I believe an event such as this should be more\n    accessible and affordable to the community in general, because it's a symbiosis. The more people attending these events,\n    the more aware they are of the current technologies on offer today, the higher the adoption rate and awareness, and\n    the whole thing propagates in a vicious cycle that can only benefit the development world.\n    </li>\n</ul>\n<p>Enough of my rant and angst, I want to emphasise on a more pressing issue at hand; which is the title of this blog today \"Brain Drain\".\nNot for the first time in recent years/months, I heard a colleague/friend saying \"Oh I used to work in <b>{insert iconic aussie company here}</b>,\nbut I'm moving to Seattle to work for Amazon now\". </p>\n<p>I have to admit, I have attended more than one interviews with\nAmazon, Facebook, Google you name it and the lure of working for these mammoth companies is irresistible. Not only the prospect\nof living and working overseas attractive for Australians, imagine how your resume will look after working for\nFacebook or Amazon. You can pretty much quit after 2 years, come back to Australia or go anywhere in the world and\nget a job based on the premise that \"Oh by the way I worked for Aws/Facebook for a couple of years\". It's definitely a legit reason\nto quit your job in Australia and move to the States.</p>\n<p>I want to challenge that temptation right now. Australia is facing a severe \"brain drain\" at the moment. What I mean by that\nis our talent is being poached by Amazon/Facebook/Google; they are leaving Australia for the States because these are the\nleading innovative tech companies at the moment. Or so people assume.</p>\n<p>Think about it for a second. If you are a developer in Australia and you are offered by Facebook to join their engineering team,\nwould you turn it down? Would you give up your lifestyle, your kids' lifestyle, your wife's career, pack up and go to Sillicon Valley\nand live happily ever after in Santa Clara? Probably. Instinctively I think most people would say yes. However, I would\nimplore you to consider more carefully.</p>\n<p>For one, food. I'm an avid food lover, and I like my food healthy and cholesterol friendly. I want my kids and family to be\nhealthy too. I'm not saying the food in the States are crap, all I'm saying is that we are spoilt for choice in Sydney.\nThere are things that we take for granted, for example good coffee or a decent loaf of bread or fresh seafood. You can still\nfind these in Sillicon Valley, but perhaps not so easily.</p>\n<p>Secondly weather. I was in San Francisco a few weeks ago and I had a chance to experience \"summer\" there. Let me tell you now you can't\nwear a bikini to the beach even in summer there. For one, there are no \"beaches\" there, at least not one that's comparable to Bondi or any beach in\nSydney. It's just way too cold even during summer to go to the beach for a dip. If you think winter in Sydney is cold, think again.</p>\n<p>I'm just really disappointed in Australia's inability to retain talent. We are a talented nation. I know so because I have been\nworking in the IT industry for over 13 years now and I've met and worked with many talented developers. Why can't Australia keep Australians\nworking in Australia in the IT industry? There are a few reasons that pop to my head.</p>\n<p>For one, the \"big\" names like Apple, Facebook, Amazon are too big to resist. Hollywood movies of Steve Jobs and \"The Social Network\" further\nextremised these views that Sillicon Valley is the place to be if you want to be somebody. I don't blame them. The Australian government are\nnot helping either, imposing strict legislations on innovative services and startups like Uber and AirBnb. </p>\n<p>Do you know that Uber is still not\ncompletely legal in Australia? Nor is AirBnb. In San Francisco, the local government are so supportive of tech and startups, it became almost\nseamless and natural that new ideas are legalised almost immediately. In fact, if you are against new ideas or innovation, you're weird. </p>\n<p>Australia need\nto embrace tech like the San Franciscans. We need to do this in order to retain talent and to be competitive with the mammoth that are Google,\nAmazon, etc in Sillicon Valley/Seattle. There is no reason why we can't nurture this culture of tech startups and innovation. There is no reason\nwhy Sydney can't have a \"Sillicon Valley\" or \"Kangaroo Valley\" (excuse the pun). We actually do have a place called Kangaroo Valley which is quite\nlovely, I highly recommend it.</p>\n<p>A change in government mentality towards technology is required in Australia to promote innovation and startups and to retain talent. I believe\none day Australia will be a comparable competitor to the States in terms of technological advancement, talent pool and innovation. Companies like\nAtlassian and Xero are leading the way, but we need more. One day the tables will turn and Australia will be the ones poaching talent from the\nStates and the rest of the world as well.</p>\n<hr>","timeToRead":4,"frontmatter":{"date":"August 05, 2016","path":"/brain-drain-australia","title":"Australia Brain Drain","files":null,"tags":["australia","brain","drain"]}}},"pageContext":{}}