{"data":{"site":{"siteMetadata":{"blurb":"Frontend Engineer @ Qantas. Tinkerer of things. Tea lover. Passionate about react graphql and making things fast."}},"markdownRemark":{"html":"<p>As I stared at the partially cloudy Parisian sky from my seat at Gare du Nord,\nI had a chance to reflect on the week that was. 4 days jam packed with\njavascript and react from morning till night followed by socialising afterwards\n(my fave), it's definitely not for the faint-hearted. I admit I was a little\noverwhelmed by the intensity of the schedule.</p>\n<h2 id=\"workshops\"><a href=\"#workshops\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Workshops</h2>\n<p>I attended a 2-day advanced react workshop with <a href=\"https://github.com/nikgraf\" target=\"_blank\" rel=\"nofollow\">Nik Graf (serverless)</a>\nand <a href=\"https://github.com/mxstbr\" target=\"_blank\" rel=\"nofollow\">Max Stoiber (styled components)</a>.\nI learnt loads about the react children api which I never really used before from Max and about\nthe apollo graphql client for react from both Nik and Max. The exercises were very hands-on and realistic.\nIn one exercise we had to implement a graphql backend and apollo front end for a recipe application.\nThis involves setting up the graphql types, queries and mutations.</p>\n<p>I am already using graphql and relay at work (qantasassure.com) so I thought this would be a piece of cake.\nNot exactly. It turns out the tools for graphql in the backend and frontend have\nevolved so much since I set it up 6 months ago, it was almost foreign to me. In a good way.\nI learnt it's so much easier and simpler now to setup a graphql server with types and queries and mutations.\nApollo really has done a lot of work to simplify the integration of graphql into react.</p>\n<p>It's so good to finally see the face behind the code! I am both a fan and user of serverless\nand styled components, so thanks for teaching me so much guys!</p>\n<img alt=\"Max Stoiber and Nik Graf\" src=\"/static/max_nik-c963a99e1eef61bb996c72e0bfdd332e.png\" id=\"markdownImage\"/>\n<h2 id=\"the-main-event\"><a href=\"#the-main-event\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>The main event</h2>\n<p>Prior to the start of the conference we heard word that Dan Abramov will not make it to Paris.\nHe had some visa issues which didn't allow him to enter Paris. Fuck. I should really ask for\na refund.</p>\n<p>Anyway the conference started with Andrew Clark (recompose) announcing the imminent release\nof react fiber (eta end of year). He's one of the better speakers in the conference. I tend to\npay more attention to people who use the stage and are comfortable moving about on the stage.\nThe delivery style of the presentation is also important. Some speakers tend to just read off\nthe screen and narrate, just the recipe to put people to sleep. Think kids and bedtime\nstory time. I expected more from all the speakers in this regard.</p>\n<p>Andrew and a few others like Lee Byron, Kevin Lacker, Sunil Pai were excellent though. Part improvised\npart narratted, I really enjoy their presentations. Sunil in particular is my favourite speaker,\nhe's really funny. His name reminds of the movie Life of Pi (of course his name is Pai, not Pi).</p>\n<p>My picks:</p>\n<p><b>Lee Byron</b> - released <a href=\"https://facebook.github.io/relay/docs/en/next/introduction-to-relay.html\" target=\"_blank\" rel=\"nofollow\">Relay Modern</a>\nlive on stage. Relay Modern now supports static queries, client side only fields and subscriptions.\nClient side only fields mean that you can use relay to replace redux. Relay classic will still be supported in npm under\nreact-relay/classic.</p>\n<p><b>Sunil Pai</b> - author of glamour, glam and rakt. Rakt is an ambitious project which aims to umm do everything. By everything I mean\ntaking care of code splitting, data fetching, inline styling (via glamour) and more. It is still not finished yet, so check\n<a href=\"https://github.com/threepointone/rakt\" target=\"_blank\" rel=\"nofollow\">Sunil's page</a> often. Sunil is my favourite speaker at the conference, he's\nengaging, impromptu and funny. All ingredients for a captivating talk.</p>\n<p><b>Andrew Clarke</b> - talks about React Fiber which will be released with React 16 at the end of the year. He also\nbriefly talked about react portals, which are components which don't quite fit in the dom tree like modals\nand overlays.</p>\n<p><b>Sarah Drasner</b> - shows really cool css animations/transforms using <a href=\"https://greensock.com/get-started-js\" target=\"_blank\" rel=\"nofollow\">GreenSock</a>.\nIt's so cool and easy to use.</p>\n<p><b>Wix lightning talk</b> - introduces <a href=\"https://github.com/wix/detox\" target=\"_blank\" rel=\"nofollow\">detox</a> which is a functional\ntesting framework for react native. It's super cool! It does grey box e2e testing of your react native apps automatically and it's super fast!\nIf you use react native you must check it out.</p>\n<p><b>Apollo lightning talk</b> - Apollo has released a <a href=\"https://github.com/apollographql/apollo-client-devtools\" target=\"_blank\" rel=\"nofollow\">chrome devtool plugin</a>\nfor graphql. It runs graphiql in chrome devtools! It also has a query inspector and a store inspector. Check it out!</p>\n<p><b>Expo lightning talk</b> - Expo has created a playground for react native at <a href=\"http://snack.expo.io\" target=\"_blank\" rel=\"nofollow\">snack.expo.io</a>.\nYou can run your react native code on the web without the simulator! It's like jsfiddle for react native.</p>\n<p><b>Sasha Aickin</b> - talks about streaming react dom to the client in chunks to boost performance. This involves chunk rendering, which is a\ntechnique involving breaking up a page into different chunks, each with its own html, js, css and data. Each chunk\ngets flushed to the client side separately, increasing parallelism and hence performance. Check out his github package\n<a href=\"https://github.com/aickin/react-dom-stream\" target=\"_blank\" rel=\"nofollow\">react-dom-stream</a></p>\n<h2 id=\"social-insights\"><a href=\"#social-insights\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Social Insights</h2>\n<p>Perhaps the best lessons I learnt from the conference are not from the speakers, but from the people I met. There\nwere many like me, all keen to share their views, opinions and experience and also to listen. Talking to these\ndevelopers gave me a chance to validate some of the assumptions I make in my projects and to see the tools and\ntechniques others use in their apps.</p>\n<p>These are some of the people I met and the insights I gathered from them:</p>\n<p><b>Dafeng Guo cofounder of strikingly</b> - started strikingly with 2 other founders in YCombinator in 2012. They had 0 paying customers\nin 2012, now they have over 130 employees and a lot more customers :). I am a user of strikingly and I can't recommend it enough. He also\nshowed me strikingly's latest wechat feature where strikingly websites now are automatically converted to wechat apps. That's super cool!</p>\n<img alt=\"Dafeng\" src=\"/static/dafeng-be0c28025424c3ada2b2b2e22fa6d1c8.png\" id=\"markdownImage\"/>\n<p><b>Griffith Tchen Pan</b> - works at myworkpapers.com. Started in Gold Coast Australia and now has offices in USA and London. 8 years of\ndedication and commitment to a product pays off. That's what I learned from him.</p>\n <img alt=\"Griffith\" src=\"/static/griffith-90c7466495c87c288e9417ac6e3b70d0.png\" id=\"markdownImage\"/>\n<p><b>Brian Christensen</b> Danish guy I met at the workshop. Arguably the smartest guy in Denmark, he knows everything from docker to glam to\nelm, and does not have a CI in place at his workplace. Just kidding Brian :). He drinks a lot.\n<img alt=\"Brian\" src=\"/static/brian-bf1d61879c7dc12dc5c7b4af89c8e346.png\" id=\"markdownImage\"/></p>\n<h1 id=\"conclusion\"><a href=\"#conclusion\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Conclusion</h1>\n<p>It's not the best organised conference I've been for a few reasons. </p>\n<p>Firstly as I mentioned above, some of the speakers weren't really very engaging.\nIt was really tough to keep awake at times. Second the food was really really bad.\nDuring the workshops, there was no protein whatsoever for lunch. It was only\nsalad, quinoa, rice, pasta. Where's the meat!!?! Or fish??!? Thirdly the cancellation of Dan Abramov was\ndisappointing. Even Max Stoiber didn't stick around to give his presentation (no reason given).\nMaybe they were put off by the food...</p>\n<p>I travelled 26 hours from Sydney Australia, stopping at 3 different countries en route to Paris,\nand then back. Is it worth it? Yes. I definitely won't forget it. Here are more pics from all\nthe great people I met. Till next time!</p>\n<img alt=\"Brian\" src=\"/static/react_conference_collage-06aad020e79ef66d8d0ecf765e7c182a.png\" id=\"markdownImage\"/>\n<hr>","timeToRead":5,"frontmatter":{"date":"May 20, 2017","path":"/react-europe","title":"React Europe","files":[{"name":"max_nik","publicURL":"/static/max_nik-c963a99e1eef61bb996c72e0bfdd332e.png"},{"name":"dafeng","publicURL":"/static/dafeng-be0c28025424c3ada2b2b2e22fa6d1c8.png"},{"name":"griffith","publicURL":"/static/griffith-90c7466495c87c288e9417ac6e3b70d0.png"},{"name":"brian","publicURL":"/static/brian-bf1d61879c7dc12dc5c7b4af89c8e346.png"},{"name":"react_conference_collage","publicURL":"/static/react_conference_collage-06aad020e79ef66d8d0ecf765e7c182a.png"}],"tags":["react","europe","conference","paris","france"]}}},"pageContext":{}}