{"data":{"markdownRemark":{"html":"<p>I am going to digress a little today and talk about how react fits into the microservice architectural style. Of course microservices and\nreact are two buzzwords we hear all the time these days. While it might look like I am just shamelessly meshing these two things\ntogether to get more visitors to my site, you can't be further than the truth (*cough). </p>\n<p>Seriously though, I first learnt of microservices from <a href=\"http://udidahan.com\" target=\"_blank\" rel=\"nofollow\">Udi Dahan</a>. For those of you who don't know him, he is the\ncreator of NServiceBus and founder of Particular Software. I have nothing but great respect and admiration for him. So you can\nunderstand my jubilation and joy when I had the chance to meet him in person today at <a href=\"http://www.dddsydney.com.au/\" target=\"_blank\" rel=\"nofollow\">DDD Sydney</a>. We talked\nabout many a thing, one of them microservices and team structure. The two might seem unrelated but they actually are, more so than you think.</p>\n<p>I was very starstruck. He seemed taller than in the videos. Maybe I was imagining things? Anyway I digress (again). So what is a service?\nI am going to shamelessly rip off Udi's quotes and say:</p>\n<p>\"A service is the technical authority for a specific business capability. It is autonomous. It has an explicit boundary. All data\nand business rules reside within the service.\"</p>\n<p>I used to think that a service is just a wcf or a webapi endpoint. For the longest time, I thought I was doing soa and microservices just\nbecause I expose wcf and webapi endpoints in my application for consumption by other applications. This is incorrect. A service is an autonomous\npiece of your domain that is self contained. For example, you might have a product service and a customer service in your domain. The product\nservice has its own aggregates and its own database schema separate and independent of the customer service. The two services have explicit\nboundaries and are autonomous. Each can use a completely different technology stack from the other. For example the product service might use\na relational database like sql server whereas the customer service might use a nosql database like mongodb. This is a very big topic which deserves\nan entire blog post or technical course in its own right so I'm going to quit while I'm ahead and point you in the right direction more for information:</p>\n<p><a href=\"https://www.youtube.com/watch?v=Irlw-LGIJO4\" target=\"_blank\" rel=\"nofollow\">Martin Fowler - Microservices@Sydney Yow!</a></p>\n<p><a href=\"http://udidahan.com/training/\" target=\"_blank\" rel=\"nofollow\">Udi Dahan - Advanced Distributed Systems Design</a></p>\n<p>See below for free samples of his training videos.</p>\n<p>Wait a minute, what's all this got to do with React? And what the heck has it got to do with team structure? Why am I still reading this crap when I could\njust easily watch a pirated copy of Game of Thrones?</p>\n<p>When you write that react component that displays a product's image, description, seller info, etc, you become, or I should say you ARE a part of\nthe Product Service team. That team comprises of you plus the backend guys which implement the endpoint that talks to the product database. So you\nthe react developer and the backend guys are all in the same Product Service team.</p>\n<p>Conway's Law: Software follows the organisational structure of people who design it.</p>\n<p>What does this mean? It means that if you are truly practising microservices, the react/angular guys and the backend .net/java guys are in the same team.\nIn reality though, this is often not the case. Companies continue to organise their teams by physical tiers i.e. front end team, back end services team,\nmobile team, database team, etc irrespective of service orientation.</p>\n<p>If you are inspired by this blog and want to know more about microservices or soa, I highly recommend you watch Udi's training videos. He\nteaches a five day course on soa and for a limited time you can watch 2 full days of the course for free. Go <a href=\"http://go.particular.net/DSY16\" target=\"_blank\" rel=\"nofollow\">here</a>\nand use the access code DSYU. This free offer expires 12 June 2016.</p>\n<hr>","timeToRead":3,"frontmatter":{"date":"May 28, 2016","path":"/react-and-microservices","title":"How React fits into the microservice team structure","files":null,"tags":["react","microservices","conways","law","team","structure"]}}},"pageContext":{}}